<PAD>
<UNK>
<EOS>
the
.
and
walk
turn
left
right
to
go
of
,
stop
on
room
stairs
into
door
down
in
wait
through
a
at
past
you
hallway
doorway
straight
bedroom
exit
table
enter
then
up
bathroom
with
your
towards
take
front
hall
kitchen
out
next
forward
around
by
near
first
doors
continue
bed
steps
top
end
chairs
area
dining
until
make
there
once
pass
wall
outside
head
that
open
glass
living
leave
bottom
two
couch
chair
inside
across
toward
just
side
when
get
white
ahead
double
before
sink
reach
second
from
large
step
staircase
between
after
pool
way
fireplace
closet
stand
are
passed
rug
is
house
going
it
behind
entrance
set
counter
move
all
wooden
red
walking
patio
'
landing
floor
other
corner
small
office
sitting
black
painting
keep
mirror
desk
facing
again
three
along
bar
another
middle
slight
archway
carpet
couches
passing
laundry
slightly
stair
leading
blue
see
follow
window
onto
entryway
long
round
an
foot
last
hard
will
brown
plant
building
sliding
stopping
island
piano
be
balcony
few
wood
opening
directly
one
railing
tv
away
sign
sofa
flight
beside
far
face
tub
using
proceed
entry
bench
refrigerator
back
this
opposite
toilet
shower
windows
third
"
picture
tables
light
where
vase
under
-
sharp
ll
massage
leads
as
foyer
cabinet
over
entering
main
walkway
stove
green
degrees
here
cross
corridor
path
stairway
four
stairwell
statue
downstairs
bathtub
lamp
s
veer
porch
lounge
big
art
upstairs
television
dinning
fridge
hanging
coffee
potted
immediate
arched
them
which
has
re
leather
immediately
tile
more
so
garage
exercise
climb
edge
home
marble
grey
wine
beds
stools
base
pictures
center
banister
flowers
standing
start
2
stone
can
plants
dresser
clock
pillar
shelves
case
deck
stepping
nearest
tree
very
mat
shelf
paintings
looking
some
cabinets
arch
empty
off
walls
short
hand
halfway
bookshelf
chandelier
direction
oven
circular
water
travel
machine
closest
feet
/
pantry
should
though
sinks
metal
have
heading
above
circle
narrow
bookcase
christmas
sculpture
washer
screen
fourth
yellow
dryer
framed
couple
thermostat
fire
switch
threshold
furniture
come
pillars
five
exiting
level
purple
gym
rope
about
brick
sauna
keeping
elevator
theater
gray
stay
column
descend
outdoor
little
indoors
via
taking
frame
turning
reaching
display
library
columns
lobby
doorways
sets
for
desks
those
sofas
rest
need
closed
tall
intersection
3
bath
ninety
spiral
artwork
french
ceiling
orange
following
study
hot
but
striped
both
gate
half
180
ottoman
he
seating
rocking
pathway
tiled
treadmill
bookshelves
wicker
pink
fountain
benches
gold
flower
moving
pong
square
ping
locker
washing
extinguisher
restroom
now
rail
switches
bear
seat
beige
stool
suite
destination
carpeted
lead
u
single
dark
fitness
reception
while
located
ve
90
animal
equipment
2nd
against
pot
nightstand
man
leftmost
(
guitar
covered
each
book
ascend
silver
lockers
partition
work
welcome
)
bike
upwards
zebra
flooring
armchairs
grass
counters
reached
vases
pews
mosaic
conference
arm
piece
curved
storage
farthest
not
den
platform
rack
soon
finish
console
microwave
cellar
space
ladder
ground
built
till
do
game
degree
hardwood
quick
master
en
flights
t
elevators
vanity
curtain
parallel
divider
entered
aisle
says
cloth
ropes
look
six
find
horse
jacuzzi
even
grand
photos
drawers
phone
position
place
bit
clear
curtains
recliner
4
roped
row
either
forwards
adjacent
mirrors
visible
outdoors
breakfast
curve
opens
close
tapestry
underneath
grill
beaded
concrete
continuing
basket
colored
beyond
oval
giant
rooms
o
smaller
armchair
fifth
dog
staircases
planter
fan
ovens
locate
doormat
vent
alongside
railings
length
staying
immediatly
drum
great
these
trees
arcade
exterior
iron
midway
almost
utility
post
tan
towel
alcove
cooler
beach
hammock
sidewalk
frames
downwards
marked
shaped
lower
prior
runner
..
pillows
pots
rectangular
machines
poster
seats
well
mini
books
radiator
like
without
colorful
further
towels
upon
its
portrait
candles
entire
ballroom
photo
or
arrive
beginning
ends
decoration
panel
barrier
movie
leaving
part
faucet
buffet
holes
rightmost
1
same
rocks
turns
placed
box
5
countertop
waiting
workout
men
yard
heater
kitchenette
love
nook
design
footstool
diagonally
climbing
several
abstract
making
passageway
family
floors
45
hang
clockwise
loveseat
support
marilyn
patterned
statues
meeting
pattern
monroe
mirrored
altar
hit
let
ornate
sectional
garden
old
air
eye
section
rock
floral
baskets
spa
loft
board
begin
dressing
bust
stones
women
lamps
line
church
recreation
wide
angle
dishwasher
looks
mounted
print
frosted
guardrail
below
checkered
chaise
coat
wardrobe
decorative
unfinished
wet
goes
floored
eight
lattice
sixth
also
pas
barber
girl
bedrooms
painted
labeled
pillow
;
washroom
computer
blanket
sailboat
starting
basketball
promptly
hallways
flag
3rd
backyard
urn
descending
arches
upper
shoes
meet
bigger
court
beam
trash
tot
dot
if
cushioned
full
swimming
credenza
approach
granite
started
rugs
made
tops
nest
chest
yourself
fence
final
telephone
sconce
many
drinking
furthest
swing
getting
armoire
#
break
cheetah
cactus
veering
american
stars
thing
dots
curving
our
tiles
still
chart
larger
opened
curio
oriental
extreme
fancy
velvet
billiard
lights
remaining
stall
alter
put
bushes
froward
star
bin
night
foosball
golden
low
cream
. .
followed
dogleg
barstools
loungers
beneath
seven
planters
curves
winding
woman
recliners
archways
folding
arrow
bowl
interior
infront
point
ledge
rounded
bridal
host
posters
arc
bush
swinging
backside
indoor
walked
comforter
tennis
no
easel
copy
distance
clothes
dinner
plaque
openings
pivot
terrace
areas
arrangement
structure
flat
garbage
holding
gallery
current
11
pedestal
palm
tablecloth
children
overlooking
paper
cushions
talk
hundred
antelope
photographs
number
filled
decorations
billiards
splits
hutch
than
eighty
containing
formal
don
screened
bannister
ball
only
mats
sit
entertainment
trunk
feather
rails
panes
please
closets
atrium
deer
settee
steel
woven
kids
lit
electrical
fork
twin
shelving
sunken
rear
construction
object
thought
brass
pew
pole
passage
topped
bottles
use
pocket
wreath
giraffe
banquet
boxes
changes
central
weight
change
fruit
ladies
globe
cupboards
violin
salon
watermelon
polka
stuffed
stained
urns
letters
handle
throught
avoid
nearby
ship
arrived
crossing
approximately
marbled
burgundy
view
powder
rows
doorknob
beads
unit
being
ascending
block
reading
bedside
6
drawer
fake
restrooms
completely
unicycle
butler
finally
jump
candle
dividers
sunset
mantle
lines
lady
teh
bird
too
cement
goal
skin
would
4th
pgi
bathrooms
bathing
int
grandfather
treadmills
stationary
gravel
pair
sides
cylinder
people
saxophone
faced
lounging
doorframe
any
spot
high
bookcases
e
wrap
son
cases
zebras
padded
crystal
lounger
stepped
huge
roof
new
counting
they
enclosed
throw
straw
run
paneled
diagonal
homes
carpeting
sculptures
body
signs
ways
ski
landscape
media
lighted
handing
barn
playroom
were
cow
leopard
theatre
pendant
mid
grain
vaulted
thirty
handrail
tun
slider
car
enerskin
pulp
horizontal
surrounded
dividing
lots
stacked
halt
projection
lips
outlet
stick
exam
plywood
houseplant
class
suitcases
projector
plate
keyboard
ten
pig
shoe
barbecue
instead
portraits
entrances
elliptical
rectangle
intersecting
fiction
lawn
guitars
reclining
pipes
grate
vertical
hangings
style
pause
gone
