<PAD>
<UNK>
<EOS>
the
.
and
walk
turn
left
right
to
go
of
,
stop
on
room
stairs
into
door
in
down
wait
through
a
at
past
you
hallway
doorway
bedroom
straight
exit
table
enter
then
bathroom
up
with
your
towards
front
take
hall
kitchen
out
forward
around
next
near
by
first
doors
continue
top
bed
chairs
steps
end
make
area
dining
until
there
pass
once
wall
outside
glass
head
open
that
leave
two
chair
inside
couch
toward
living
across
bottom
just
white
when
side
get
double
sink
ahead
before
reach
large
from
second
step
staircase
between
after
fireplace
pool
closet
way
stand
are
house
passed
behind
is
going
it
rug
entrance
set
counter
move
patio
walking
office
landing
'
all
desk
wooden
other
black
small
painting
keep
corner
facing
floor
mirror
red
again
sitting
three
slight
middle
along
bar
laundry
couches
slightly
another
passing
stair
blue
archway
leading
see
entryway
onto
round
window
long
foot
last
an
follow
will
building
carpet
hard
brown
plant
balcony
be
stopping
sliding
piano
few
opening
wood
away
one
railing
island
tv
sign
bench
sofa
face
directly
beside
using
flight
proceed
tables
tub
far
entry
opposite
back
this
refrigerator
light
third
shower
picture
windows
where
"
main
toilet
-
as
vase
ll
under
walkway
sharp
foyer
leads
green
over
entering
cross
corridor
degrees
lounge
massage
stairwell
bathtub
here
s
stairway
veer
path
porch
stove
statue
cabinet
lamp
upstairs
which
them
re
art
dinning
downstairs
television
beds
leather
garage
immediate
potted
hanging
so
big
immediately
marble
four
climb
fridge
has
home
grey
coffee
pictures
base
can
2
exercise
tile
stone
stools
arched
more
flowers
plants
dresser
center
tree
start
banister
pillar
edge
standing
deck
stepping
wine
case
water
paintings
empty
mat
walls
shelves
very
hand
sinks
cabinets
machine
shelf
nearest
bookshelf
metal
screen
feet
looking
christmas
closest
chandelier
heading
washer
off
halfway
some
narrow
fourth
/
clock
have
elevator
dryer
travel
short
direction
purple
circular
sculpture
should
switch
bookcase
yellow
thermostat
about
though
five
arch
stay
circle
come
taking
indoors
above
pillars
threshold
gym
column
theater
fire
framed
furniture
rope
exiting
brick
desks
couple
keeping
level
gray
oven
turning
little
rest
descend
via
spiral
columns
orange
gate
outdoor
need
pantry
library
reaching
frame
artwork
doorways
but
those
lobby
closed
tall
benches
half
ceiling
study
sets
restroom
striped
ninety
hot
following
3
ottoman
seating
bookshelves
washing
he
wicker
for
locker
fountain
rocking
sofas
display
ping
intersection
gold
both
180
pong
rail
french
pathway
pink
sauna
tiled
extinguisher
reception
now
flower
moving
bath
2nd
guitar
u
switches
square
equipment
while
single
(
bear
partition
treadmill
conference
bike
ascend
work
carpeted
lead
stool
zebra
curved
)
suite
destination
piece
located
beige
silver
seat
flooring
pot
dark
animal
space
against
lockers
built
arm
armchairs
horse
leftmost
farthest
nightstand
pews
90
soon
book
covered
upwards
mosaic
game
elevators
cloth
quick
each
reached
welcome
recliner
hardwood
grand
master
aisle
divider
not
rack
vanity
six
find
till
ve
curtains
do
finish
says
storage
t
den
tapestry
forwards
look
4
man
clear
arcade
cooler
even
mirrors
staircases
smaller
outdoors
armchair
hammock
opens
en
flights
concrete
great
adjacent
fifth
phone
continuing
position
planter
row
o
curve
beach
trees
jacuzzi
entered
oval
close
degree
giant
iron
vent
ground
mini
almost
alongside
colorful
photos
place
breakfast
platform
ballroom
fan
ovens
parallel
locate
machines
exterior
fitness
poster
marked
faucet
utility
counters
rocks
underneath
heater
length
entire
visible
drawers
towel
decoration
alcove
either
movie
cellar
staying
portrait
shaped
doormat
rooms
..
prior
dog
tan
basket
beginning
colored
pillows
beyond
books
microwave
rectangular
towels
box
ladder
kitchenette
buffet
drum
or
holes
seats
midway
1
same
floors
arrive
meeting
grill
roped
further
runner
these
rock
marilyn
panel
grass
bit
upon
sidewalk
leaving
candles
sectional
downwards
abstract
men
well
dishwasher
lower
console
turns
stones
monroe
family
5
curtain
print
radiator
hang
immediatly
garden
workout
railings
45
chaise
rightmost
barrier
nook
ropes
barber
its
computer
passageway
like
ends
section
diagonally
basketball
part
flag
wet
frosted
ornate
board
countertop
vases
loveseat
checkered
without
coat
begin
bedrooms
air
arches
mounted
floral
women
floored
lamps
court
granite
line
church
frames
unfinished
clockwise
let
spa
wide
climbing
trash
photo
several
guardrail
support
sixth
making
wardrobe
final
sconce
patterned
dot
post
dots
swing
pattern
painted
baskets
altar
opened
shoes
break
loft
pots
hit
fancy
love
recreation
velvet
statues
lights
below
waiting
full
lattice
3rd
many
angle
swimming
started
froward
decorative
looks
curving
approach
drinking
bridal
our
host
furthest
credenza
labeled
arc
pillow
descending
washroom
blanket
mirrored
;
upper
beneath
#
bush
meet
swinging
bust
planters
cheetah
curves
put
cactus
american
remaining
stall
winding
tennis
tot
folding
placed
copy
backyard
arrow
bowl
design
pas
girl
structure
walked
archways
posters
larger
footstool
tiles
eighty
garbage
golden
containing
tops
flat
screened
extreme
seven
sailboat
chest
eight
yourself
rounded
clothes
promptly
goes
hallways
comforter
hundred
getting
recliners
no
easel
still
photographs
also
distance
bigger
old
wreath
bushes
interior
plaque
openings
paper
ledge
settee
bin
foosball
areas
arrangement
giraffe
changes
armoire
billiard
telephone
object
kids
don
holding
gallery
rugs
dogleg
fork
shelving
backside
infront
only
tablecloth
loungers
construction
low
oriental
salon
overlooking
urn
sit
stained
children
veering
woman
stars
number
topped
thing
billiards
cushioned
ladies
panes
use
pocket
. .
avoid
nest
filled
closets
dinner
decorations
ship
burgundy
too
point
pivot
bathrooms
goal
terrace
night
dressing
banquet
steel
gravel
cushions
doorknob
than
followed
mats
fruit
entertainment
current
made
twin
barstools
11
thought
pedestal
palm
ball
rear
ascending
cupboards
starting
drawer
indoor
watermelon
polka
cylinder
restrooms
beam
handle
passage
feather
doorframe
cement
alter
jump
reading
if
bottles
fence
brass
nearby
grandfather
central
saxophone
lady
lounging
teh
enerskin
wrap
son
bird
pulp
deer
plywood
surrounded
crossing
approximately
skin
roof
stacked
marbled
zebras
hutch
pipes
lounger
woven
huge
view
4th
dividers
padded
they
body
enclosed
unit
formal
lit
treadmills
straw
projector
paneled
car
carpeting
6
pig
were
pair
sides
fake
hangings
pgi
handing
talk
powder
elliptical
portraits
entrances
pause
trunk
plate
cow
faced
finally
leopard
theatre
any
candle
fiction
sunset
spot
keyboard
guitars
grate
arrived
pole
lines
